#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Ans:

In [1]:
import pandas as pd

In [4]:
series = pd.Series([4,8,15,16,23,42])

In [5]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
type(series)

pandas.core.series.Series

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

Ans:

In [7]:
l = list(range(1 , 11))

In [8]:
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [10]:
series_1 = pd.Series(l)

In [11]:
series_1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [13]:
type(series_1)

pandas.core.series.Series

#### Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

Ans :

In [15]:
df = pd.DataFrame({'Name':['Alice','Bob','Claire'],
             'Age':[25,30,27],
             'Gender':['Female','Male','Female']})

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans:

DataFrame:
    
    DataFrame is the collection of Series.
    
    DataFrame is the collection rows and columns.
    
    Series is the multiple records or rows but it has only one column.
    
    Series is a one-dimensional labeled array capable of holding any data type.
    
    Series is one dimensional.
    
    DataFrame is the two dimensional.
    
    Series is must be homogenous data means it contains same data.
    
    DataFrame is must be heterogenous data means it contains all type of data.
    
    eg : As expalined in below example ,
        
        series has only one data which is object (str).
        
        DataFrame contains heterogenous data like object (str) , int , object(str)

In [17]:
df = pd.DataFrame({'Name':['Alice','Bob','Claire'],
             'Age':[25,30,27],
             'Gender':['Female','Male','Female']})

In [18]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [22]:
name = df['Name']

In [23]:
name

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [24]:
type(name)

pandas.core.series.Series

In [29]:
name.dtypes

dtype('O')

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Ans:

In [30]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

##### Head

In [31]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

##### Tail

In [32]:
df.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

##### dtype

In [35]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

##### columns

In [36]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

##### isna() or isnull()

In [37]:
df.isna()

    Name    Age  Gender
0  False  False   False
1  False  False   False
2  False  False   False

In [38]:
df.isna()

    Name    Age  Gender
0  False  False   False
1  False  False   False
2  False  False   False

#####  shape

In [39]:
df.shape

(3, 3)

##### size

In [42]:
df.size

9

##### info

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

##### duplicate

In [44]:
df.duplicated()

0    False
1    False
2    False
dtype: bool

##### skew

In [45]:
df.skew()

C:\Users\Pritam\AppData\Local\Temp/ipykernel_2920/1665899112.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.skew()

Age    0.585583
dtype: float64

##### correleation

In [46]:
df.corr()

     Age
Age  1.0

##### describe

In [47]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

##### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans:

In [51]:
series_1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [50]:
series_1[0]

1

In [53]:
series_1[0] = 12

In [54]:
series_1

0    12
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

##### Series is mutable in nature.

In [55]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [58]:
df['Name'][0] = 'sam'

C:\Users\Pritam\AppData\Local\Temp/ipykernel_2920/3017831699.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'sam'

In [60]:
df['Age'][0] = 12

C:\Users\Pritam\AppData\Local\Temp/ipykernel_2920/969840783.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'][0] = 12

In [77]:
df

     Name  Age  Gender
0     sam   12  Female
1     Bob   30    Male
2  Claire   27  Female

##### DataFrame is mutable in nature

##### Panel is mutable in nature

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans:

In [104]:
d = {'Data_1': pd.Series(range(1 , 10)) , 'Data_2': pd.Series(range(11, 20)) , 'Data_3':pd.Series(range(21 , 30))}

In [105]:
df =pd.DataFrame(d)

In [106]:
df_1

   Data_1  Data_2  Data_3
0       1      11      21
1       2      12      22
2       3      13      23
3       4      14      24
4       5      15      25
5       6      16      26
6       7      17      27
7       8      18      28
8       9      19      29

#### Here we create DataFrame by using multiple series . we create dictionary with name d. dictionary contains key and value.

#### so key is nothing but our column names and values are create by using series data structure.